import React from 'react';

const TeamPage = () => {
    return (
        <div>
            <h1>👨‍💼 小组分工</h1>
            <div>
                <h2>组长：袁俊超</h2>
                <p>
                    负责后端，算法，调优等等关键实现。主要工作包括：<br />
                    - 🚶‍♂️👨‍🦰 人，车流量统计（deepsort）：使用DeepSort算法对视频中的人和车辆进行跟踪和计数。<br />
                    - 🧠 基于YOLOv5的人车计数及锚点框：利用YOLOv5模型检测视频帧中的人和车辆，并绘制锚点框以进行进一步的分析。<br />
                    - 🛠️ 后端优化：通过调优算法和数据库查询，提高系统性能和响应速度。<br />
                    - 📊 数据处理：设计和实现高效的数据处理管道，确保数据准确性和完整性。<br />
                    - 🔍 结果验证：对处理结果进行验证和测试，确保结果的准确性和可靠性。
                </p>
            </div>
            <div style={{ marginBottom: '20px' }}>
                <h2>柳清扬</h2>
                <p>
                    前端，负责前端React框架搭建，实现数据可视化，UI设计，负责前后端的链接，以及关键服务的部署。主要工作包括：<br />
                    - 🖥️ React框架搭建：搭建并维护前端项目结构，确保代码质量和性能。<br />
                    - 📊 数据可视化：使用图表库（如Echarts）实现人车流量统计的可视化展示。<br />
                    - 🎨 UI设计：设计并优化用户界面，提高用户体验。<br />
                    - 🔗 前后端链接：实现前端与后端API的无缝对接，确保数据的正确传输与展示。<br />
                    - ☁️ 关键服务部署：负责部署Minio对象存储服务和Elasticsearch数据库，以支持数据存储和搜索功能。
                </p>
            </div>
            <div style={{ marginBottom: '20px' }}>
                <h2>高羽</h2>
                <p>
                    负责数据端处理，ES所有操作实现，Minio上传并将其导入到ES数据库中，实现简洁版接口方便调用。主要工作包括：<br />
                    - 🗃️ 数据处理：处理和清洗从前端和后端获取的数据，以便进行进一步的分析和存储。<br />
                    - 🔍 Elasticsearch操作：实现对Elasticsearch数据库的所有CRUD操作，确保数据的快速检索和管理。<br />
                    - 📦 Minio上传：将处理后的数据上传到Minio对象存储服务，并将其导入到Elasticsearch数据库中。<br />
                    - 🌐 简洁版接口：开发和维护简洁易用的接口，方便前端和后端调用。<br />
                    - 📈 性能优化：通过优化数据处理和存储流程，提高系统性能和效率。
                </p>
            </div>
            <div style={{ marginBottom: '20px' }}>
                <h2>张步青</h2>
                <p>
                    负责车辆车牌OCR识别算法的全部流程，数据，视频处理，返回给数据端数据进行存储方便后续调用并查询结果到前端。主要工作包括：<br />
                    - 🚗 车牌OCR识别：开发和优化车牌识别算法，确保高精度的识别结果。<br />
                    - 🎥 视频处理：处理输入的视频数据，提取关键帧并进行车牌识别。<br />
                    - 💾 数据存储：将识别结果和相关数据存储到数据端，方便后续的调用和查询。<br />
                    - 🔄 数据查询：实现接口，方便前端查询和显示车牌识别的结果。<br />
                    - 📊 结果分析：分析识别结果，生成统计报告和数据可视化，以供进一步研究和优化。
                </p>
            </div>
        </div>
    );
};

export default TeamPage;
